Repository: mlgtcode/Log-in-with-Blesta-WP-Plugin
Catalog: languages/blesta-login-integration-*.po
Languages: de_de, fr_fr, it_it

source: Blesta API Configuration
de_de: Blesta API-Konfiguration
fr_fr: Configuration de l'API Blesta
it_it: Configurazione API Blesta

source: Settings saved.
de_de: Einstellungen gespeichert.
fr_fr: Paramètres enregistrés.
it_it: Impostazioni salvate.

source: You do not have sufficient permissions to access this page.
de_de: Sie haben nicht die erforderlichen Berechtigungen, um auf diese Seite zuzugreifen.
fr_fr: Vous n'avez pas les autorisations nécessaires pour accéder à cette page.
it_it: Non hai i permessi necessari per accedere a questa pagina.

source: Blesta API URL
fr_fr: URL de l'API Blesta
it_it: URL API Blesta

source: Blesta API User
de_de: Blesta API-Benutzer
fr_fr: Utilisateur de l'API Blesta
it_it: Utente API Blesta

source: Blesta API Key
de_de: Blesta API-Schlüssel
fr_fr: Clé de l'API Blesta
it_it: Chiave API Blesta

source: SSL Verification
de_de: SSL-Überprüfung
fr_fr: Vérification SSL
it_it: Verifica SSL

source: Debug Mode
de_de: Debug-Modus
fr_fr: Mode débogage
it_it: Modalità Debug

source: Enable User Creation
de_de: Benutzererstellung aktivieren
fr_fr: Activer la création d'utilisateur
it_it: Abilita creazione utente

source: Turnstile Site Key
de_de: Turnstile-Site-Schlüssel
fr_fr: Clé du site Turnstile
it_it: Chiave sito Turnstile

source: Turnstile Secret Key
de_de: Turnstile-Geheimschlüssel
fr_fr: Clé secrète Turnstile
it_it: Chiave segreta Turnstile

source: Enable Turnstile CAPTCHA
de_de: Turnstile-CAPTCHA aktivieren
fr_fr: Activer le CAPTCHA Turnstile
it_it: Abilita CAPTCHA Turnstile

source: Login with Billing Credentials
de_de: Mit Abrechnungsdaten anmelden
fr_fr: Connexion avec les identifiants de facturation
it_it: Accedi con credenziali di fatturazione

source: Username
de_de: Benutzername
fr_fr: Nom d'utilisateur
it_it: Nome utente

source: Password
de_de: Passwort
fr_fr: Mot de passe

source: Login
de_de: Anmelden
fr_fr: Connexion
it_it: Accedi

source: Logout
de_de: Abmelden
fr_fr: Déconnexion
it_it: Disconnetti

source: CAPTCHA verification failed. Please try again.
de_de: CAPTCHA-Überprüfung fehlgeschlagen. Bitte versuchen Sie es erneut.
fr_fr: La vérification CAPTCHA a échoué. Veuillez réessayer.
it_it: Verifica CAPTCHA fallita. Per favore riprova.

source: The username or password you entered is incorrect. Please try again.
de_de: Der eingegebene Benutzername oder das Passwort ist falsch. Bitte versuchen Sie es erneut.
fr_fr: Le nom d'utilisateur ou le mot de passe que vous avez saisi est incorrect. Veuillez réessayer.
it_it: Il nome utente o la password inseriti non sono corretti. Per favore riprova.

source: New User Email Required
de_de: Neue Benutzer-E-Mail erforderlich
fr_fr: Adresse e-mail du nouvel utilisateur requise
it_it: Email nuovo utente richiesta

source: Please provide an email address for the new user:
de_de: Bitte geben Sie eine E-Mail-Adresse für den neuen Benutzer an:
fr_fr: Veuillez fournir une adresse e-mail pour le nouvel utilisateur :
it_it: Per favore fornisci un indirizzo email per il nuovo utente:

source: Submit
de_de: Einreichen
fr_fr: Soumettre
it_it: Invia

source: Invalid email address provided.
de_de: Ungültige E-Mail-Adresse angegeben.
fr_fr: Adresse e-mail invalide fournie.
it_it: Indirizzo email fornito non valido.

source: Try Again
de_de: Erneut versuchen
fr_fr: Réessayer
it_it: Riprova

source: You are already logged in.
de_de: Sie sind bereits eingeloggt.
fr_fr: Vous êtes déjà connecté.
it_it: Sei già connesso.

source: Save Changes
de_de: Änderungen speichern
fr_fr: Enregistrer les modifications
it_it: Salva modifiche

source: Configure the general settings for the Blesta API integration, including API credentials and user creation options.
de_de: Konfigurieren Sie die allgemeinen Einstellungen für die Blesta-API-Integration, einschließlich API-Anmeldeinformationen und Benutzererstellungsoptionen.
fr_fr: Configurez les paramètres généraux pour l'intégration de l'API Blesta, y compris les identifiants API et les options de création d'utilisateur.
it_it: Configura le impostazioni generali per l'integrazione dell'API Blesta, incluse le credenziali API e le opzioni di creazione utente.

source: Configure the CAPTCHA settings to enhance security during login attempts.
de_de: Konfigurieren Sie die CAPTCHA-Einstellungen, um die Sicherheit bei Anmeldeversuchen zu erhöhen.
fr_fr: Configurez les paramètres CAPTCHA pour renforcer la sécurité lors des tentatives de connexion.
it_it: Configura le impostazioni CAPTCHA per migliorare la sicurezza durante i tentativi di accesso.

source: Enter the base URL of your Blesta API endpoint (e.g., https://yourdomain.com/api/).
de_de: Geben Sie die Basis-URL Ihres Blesta-API-Endpunkts ein (z. B. https://yourdomain.com/api/).
fr_fr: Entrez l'URL de base de votre point de terminaison API Blesta (par exemple, https://yourdomain.com/api/).
it_it: Inserisci l'URL di base del tuo endpoint API Blesta (es., https://yourdomain.com/api/).

source: Provide the username for accessing the Blesta API.
de_de: Geben Sie den Benutzernamen für den Zugriff auf die Blesta-API an.
fr_fr: Fournissez le nom d'utilisateur pour accéder à l'API Blesta.
it_it: Fornisci il nome utente per accedere all'API Blesta.

source: Enter the API key associated with the Blesta API user. This key will be encrypted for security.
de_de: Geben Sie den API-Schlüssel ein, der mit dem Blesta-API-Benutzer verknüpft ist.
fr_fr: Entrez la clé API associée à l'utilisateur de l'API Blesta. Cette clé sera cryptée pour des raisons de sécurité.
it_it: Inserisci la chiave API associata all'utente API Blesta. Questa chiave sarà crittografata per sicurezza.

source: Enable this option to verify SSL certificates when connecting to the Blesta API.
de_de: Aktivieren Sie diese Option, um SSL-Zertifikate bei der Verbindung mit der Blesta-API zu überprüfen.
fr_fr: Activez cette option pour vérifier les certificats SSL lors de la connexion à l'API Blesta.
it_it: Abilita questa opzione per verificare i certificati SSL durante la connessione all'API Blesta.

source: Enable debug mode to for troubleshooting purposes.
de_de: Aktivieren Sie den Debug-Modus zu Fehlerbehebungszwecken.
fr_fr: Activez le mode débogage à des fins de dépannage.

source: Allow automatic creation of WordPress accounts for users who authenticate successfully via the Blesta API.
de_de: Ermöglichen Sie die automatische Erstellung von WordPress-Konten für Benutzer, die sich erfolgreich über die Blesta-API authentifizieren.
fr_fr: Autorisez la création automatique de comptes WordPress pour les utilisateurs qui s'authentifient avec succès via l'API Blesta.
it_it: Consenti la creazione automatica di account WordPress per gli utenti che si autenticano con successo tramite l'API Blesta.

source: Enter the site key provided by Cloudflare Turnstile for CAPTCHA verification.
de_de: Geben Sie den von Cloudflare Turnstile bereitgestellten Site-Schlüssel für die CAPTCHA-Überprüfung ein.
fr_fr: Entrez la clé du site fournie par Cloudflare Turnstile pour la vérification CAPTCHA.
it_it: Inserisci la chiave del sito fornita da Cloudflare Turnstile per la verifica CAPTCHA.

source: Enter the secret key provided by Cloudflare Turnstile for CAPTCHA verification. This key will be encrypted for security.
de_de: Geben Sie den von Cloudflare Turnstile bereitgestellten geheimen Schlüssel für die CAPTCHA-Überprüfung ein.
fr_fr: Entrez la clé secrète fournie par Cloudflare Turnstile pour la vérification CAPTCHA. Cette clé sera cryptée pour des raisons de sécurité.
it_it: Inserisci la chiave segreta fornita da Cloudflare Turnstile per la verifica CAPTCHA. Questa chiave sarà crittografata per sicurezza.

source: Enable this option to add CAPTCHA verification to the login form, enhancing security against automated login attempts.
de_de: Aktivieren Sie diese Option, um der Anmeldemaske eine CAPTCHA-Überprüfung hinzuzufügen und die Sicherheit gegen automatisierte Anmeldeversuche zu erhöhen.
fr_fr: Activez cette option pour ajouter une vérification CAPTCHA au formulaire de connexion, renforçant ainsi la sécurité contre les tentatives de connexion automatisées.
it_it: Abilita questa opzione per aggiungere la verifica CAPTCHA al modulo di accesso, migliorando la sicurezza contro i tentativi di accesso automatizzati.

source: Shortcode Usage
de_de: Shortcode-Nutzung
fr_fr: Utilisation du shortcode

source: You can use the following shortcode to display the login form on any page or post:
de_de: Sie können den folgenden Shortcode verwenden, um das Anmeldeformular auf einer beliebigen Seite oder einem Beitrag anzuzeigen:
fr_fr: Vous pouvez utiliser le shortcode suivant pour afficher le formulaire de connexion sur n'importe quelle page ou publication :

source: Simply copy and paste the shortcode into the content editor where you want the login form to appear.
de_de: Kopieren Sie einfach den Shortcode und fügen Sie ihn in den Inhaltseditor ein, an der Stelle, an der das Anmeldeformular angezeigt werden soll.
fr_fr: Copiez et collez simplement le shortcode dans l'éditeur de contenu à l'endroit où vous souhaitez que le formulaire de connexion apparaisse.

source: If CAPTCHA is enabled, it will automatically be included in the form.
de_de: Wenn CAPTCHA aktiviert ist, wird es automatisch im Formular enthalten sein.
fr_fr: Si le CAPTCHA est activé, il sera automatiquement inclus dans le formulaire.

source: Enable debug mode to log API requests and responses for troubleshooting purposes.
it_it: Abilita la modalità debug per registrare le richieste e le risposte API a scopo di risoluzione dei problemi.
